#pragma once
// ===================================================================== */
//  include space
// ===================================================================== */
#include <Engine/Objects/3D/Actor/BaseGameObject.h>

/*-----------------------------------------------------------------------------------------
 * BackgroundActor
 * - 背景オブジェクトの基底クラス
 * - 背景オブジェクトの共通インターフェースや基本機能を提供
 * - 具体的な背景オブジェクトはこのクラスを継承して実装する
 *---------------------------------------------------------------------------------------*/
class BackgroundActor :
	public BaseGameObject {
public:
	//===================================================================*/
	//			public methods
	//===================================================================*/
	BackgroundActor();
	~BackgroundActor() override;
};