#pragma once
#include <Engine/Objects/3D/Actor/Actor.h>

/*-----------------------------------------------------------------------------------------
 * DemoPlayer
 * - 本エンジンのデモ用操作可能キャラクター
 *---------------------------------------------------------------------------------------*/
class DemoPlayer 
	:public Actor{
public:
	//===================================================================*/
	//						public methods
	//===================================================================*/
	DemoPlayer();
	~DemoPlayer() override = default;

	void Initialize() override;
	void Update(float dt) override;

private:
	//===================================================================*/
	//						private methods
	//===================================================================*/


};
