#pragma once
/* ========================================================================
/* include space
/* ===================================================================== */
#include "IOnViewportTool.h"

/*-----------------------------------------------------------------------------------------
 * DebugTextOverlay
 * - デバッグテキストオーバーレイクラス
 * - ビューポート上に任意のデバッグテキストを表示するためのクラス
 *---------------------------------------------------------------------------------------*/
class DebugTextOverlay final
	: public CalyxEditor::BaseOnViewportTool {
public:
	//===================================================================*/
	//					methods
	//===================================================================*/
	DebugTextOverlay();
	~DebugTextOverlay() override;

	/**
	 * ビューポート上にデバッグテキストを描画
	 * - basePos: 描画開始位置（ビューポートの左上を基準としたスクリーン座標）
	 */
	void RenderOverlay(const ImVec2& basePos) override;

private:
	//===================================================================*/
	//					fields
	//===================================================================*/
};
