#pragma once
/* ========================================================================
/* include space
/* ===================================================================== */

struct MeshResource;
/*-----------------------------------------------------------------------------------------
 * IPrimitiveMesh
 * - プリミティブメッシュインターフェース
 * - 単純形状オブジェクトの共通インターフェースを定義
 *---------------------------------------------------------------------------------------*/
/**
 * @brief IPrimitiveMeshの機能を提供するクラスです。
 */
class IPrimitiveMesh{
public:
	//===================================================================*/
	//			public methods
	//===================================================================*/
	virtual ~IPrimitiveMesh() = default;

	virtual void Update(float dt) = 0;

	// 現在のメッシュへの参照を返す
	virtual MeshResource& Mesh() = 0;

	// 内部パラメータ変更時の再生成
	virtual void Rebuild() = 0;
};
