#pragma once

#include <Engine/Objects/2D/Actor/Character2D.h>

/*-----------------------------------------------------------------------------------------
* 2dオブジェクトを使用したプレイヤークラス
* - タイトルやゲームオーバー画面での操作キャラクターとして使用
*---------------------------------------------------------------------------------------*/
class Player2D final 
	: public Calyx2D::Character2D {
public:
	//===================================================================*/
	//			public methods
	//===================================================================*/
	Player2D();
	~Player2D() override;

	void Initialize() override;
	void Update(float deltaTime) override;
	void ShowGui() override;
	
private:
	//===================================================================*/
	//			private methods
	//===================================================================*/
	
};
