#pragma once

namespace CalyxEngine {

	/*----------------------------------------------------------------------
	 * ImguiLayoutService
	 * - ImGui レイアウトサービスクラス
	 * - ImGui レイアウト管理のためのサービスを提供
	 *--------------------------------------------------------------------*/
	/**
	 * @brief ImguiLayoutServiceの機能を提供するクラスです。
	 */
	class ImguiLayoutService {
	public:
		//===================================================================*/
		//			public methods
		//===================================================================*/
		ImguiLayoutService();
		~ImguiLayoutService();

	private:
		//===================================================================*/
		//			private members
		//===================================================================*/

	};

}
